# coding=utf-8
# 配置股票黑名单
# 列出当且极不适宜购买的股票
# 注：1. 黑名单有时效性，回测的时候最好不使用，模拟交易建议使用
#     2. 用一模块或者大数据分析收集这类股票，定时更新
def get_blacklist():
    # 黑名单一览表，更新时间 2016.7.10 by 沙米
    # 科恒股份、太空板业，一旦2016年继续亏损，直接面临暂停上市风险
    blacklist = ['002715.XSHE', '000526.XSHE', '300135.XSHE', '002207.XSHE', '000033.XSHE', '002667.XSHE', '000511.XSHE', 
                 '000788.XSHE', '600649.XSHG', '000995.XSHE', '600301.XSHG', '002473.XSHE', '002072.XSHE', '000798.XSHE', 
                 '300208.XSHE', '300117.XSHE', '300372.XSHE', '000613.XSHE', '600421.XSHG', '600375.XSHG', '000617.XSHE', 
                 '000748.XSHE', '600403.XSHG', '300311.XSHE', '600319.XSHG', '000950.XSHE', '600675.XSHG', '600005.XSHG', 
                 '002181.XSHE', '600866.XSHG', '601918.XSHG', '300344.XSHE', '600520.XSHG', '600806.XSHG', '600212.XSHG', 
                 '600306.XSHG', '600230.XSHG', '600760.XSHG', '000922.XSHE', '600432.XSHG', '600603.XSHG', '000693.XSHE', 
                 '000670.XSHE', '000629.XSHE', '600265.XSHG', '600423.XSHG', '300028.XSHE', '600817.XSHG', '601106.XSHG', 
                 '600339.XSHG', '600228.XSHG', '000780.XSHE', '300340.XSHE', '600701.XSHG', '601558.XSHG', '600767.XSHG']
    return blacklist
